---
title: GradientBackgroundSettings
classe: Autodesk.Revit.DB.GradientBackgroundSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BackgroundSettings
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# GradientBackgroundSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Color GroundColor { get; set; }` | `gradientBackgroundSettings.GroundColor` | Color |
| `Color HorizonColor { get; set; }` | `gradientBackgroundSettings.HorizonColor` | Color |
| `Color SkyColor { get; set; }` | `gradientBackgroundSettings.SkyColor` | Color |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```